# Задача 1 - Написать программу, которая проверяет есть ли в стихах Ритм. Стихотворение  вводится с с клавиатуры.
# Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами.
# Фразы отделяются друг от друга пробелами.
# Ритм есть, если число слогов (т.е. число гласных букв) в каждой Фразе стихотворения одинаковое
# В ответе напишите “Парам пам-пам” - если Ритм есть и “Пам парам” - если Ритма нет

# Пример:
# Ввод: пара-ра-рам рам-пам-папам па-ра-па-да
# Вывод: Парам пам-пам
