# Задача 3 -
# Задача 3 - В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова.
# Английские буквы:
# A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка;
# B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка;
# K – 5 очков;
# J, X – 8 очков;
# Q, Z – 10 очков.
# Русские буквы:
# А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;
# Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков;
# Ф, Щ, Ъ – 10 очков.
# Будем считать, что на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы.

dict_engl = {1: ['A', 'E', 'I', 'O', 'U', 'L', 'N', 'S', 'T', 'R'],
             2: ['D', 'G'],
             3: ['B', 'C', 'M', 'P'],
             4: ['F', 'H', 'V', 'W', 'Y'],
             5: 'K', '8': ['J', 'X'],
             10: ['Q', 'Z']}

dict_rus = {1: ['А', 'В', 'Е', 'И', 'Н', 'О', 'Р', 'С', 'Т'],
            2: ['Д', 'К', 'Л', 'М', 'П', 'У'],
            3: ['Б', 'Г', 'Ё', 'Ь', 'Я'],
            4: ['Й', 'Ы'],
            5: ['Ж', 'З', 'Х', 'Ц', 'Ч'],
            8: ['Ш', 'Э', 'Ю'],
            10: ['Ф', 'Щ', 'Ъ']}

# print(dict_engl)

lang = input(
    'Укажите язык: введите букву А (aнглийский), Р (русский): ').upper()
word = input("Напишите слово: ").upper()
# print(len(word)) # для проверки
# print(lang) # для проверки

score = 0

if lang == 'Р' or lang == 'P':
    # print(lang == 'Р' or lang == 'P') # для проверки
    for i in word:
        for (k, v) in dict_rus.items():
            for j in v:
                if i == j:
                    score += int(k)
                # print(i, "  ", j, "  ", score) # для проверки
    print(f"Итого баллов = {score}")

elif lang == 'A' or lang == 'А':
    for i in word:
        if lang == 'A' or lang == 'А':
            for (k, v) in dict_engl.items():
                for j in v:
                    if i == j:
                        score += int(k)
    print(f"Итого баллов = {score}")

else:
    print("Укажите корректно язык")
